{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "verification": 2,
    "code": 3,
    "social": 4,
    "update": 5,
    "account": 6,
    "activity": 7,
    "payment": 8,
    "debit": 9,
    "alert": 10,
    "transaction": 11,
    "completed": 12,
    "cimb": 13,
    "to:": 14,
    "tan": 15,
    "soon": 16,
    "lan": 17,
    "system": 18,
    "notification": 19,
    "package": 20,
    "delivery": 21,
    "security": 22,
    "weather": 23,
    "reminder": 24,
    "data": 25,
    "usage": 26,
    "news": 27,
    "calendar": 28,
    "health": 29,
    "foodpanda": 30,
    "bank": 31,
    "islam": 32,
    "new": 33,
    "message": 34,
    "connectivity": 35,
    "transfer": 36,
    "successful.": 37,
    "purchase": 38,
    "confirmation": 39,
    "digi": 40,
    "successful": 41,
    "mcdonald's": 42,
    "gxbank": 43,
    "duitnow": 44,
    "shell": 45,
    "apple": 46,
    "services": 47,
    "rhb": 48,
    "app": 49,
    "hong": 50,
    "leong": 51,
    "white": 52,
    "curry": 53,
    "mee": 54,
    "selayang": 55,
    "restoran": 56,
    "kam": 57,
    "ying": 58,
    "maybank": 59,
    "grab": 60,
    "ahmad": 61,
    "bin": 62,
    "ismail": 63,
    "public": 64,
    "seamoney": 65,
    "capital": 66,
    "malaysia": 67,
    "ambank": 68,
    "tesco": 69,
    "goh": 70,
    "ru": 71,
    "yin": 72,
    "astro": 73,
    "starbucks": 74,
    "tng": 75,
    "reload": 76,
    "shopee": 77,
    "mrt": 78,
    "7-eleven": 79,
    "tealive": 80,
    "airasia": 81,
    "celcom": 82,
    "mydin": 83,
    "tenaga": 84,
    "nasional": 85,
    "berhad": 86,
    "mynews": 87,
    "alliance": 88,
    "rides-ec": 89,
    "petaling": 90,
    "jaya": 91,
    "lim": 92,
    "guan": 93,
    "eng": 94,
    "time": 95,
    "siti": 96,
    "nurhaliza": 97,
    "grabfood": 98,
    "watsons": 99,
    "telekom": 100,
    "guardian": 101,
    "maxis": 102,
    "grocer": 103,
    "kfc": 104,
    "99": 105,
    "speedmart": 106,
    "uniqlo": 107,
    "lee": 108,
    "wei": 109,
    "popular": 110,
    "bookstore": 111,
    "google": 112,
    "one": 113,
    "lazada": 114,
    "your": 115,
    "balance": 116,
    "is": 117,
    "rm150.50.": 118,
    "forecast": 119,
    "for": 120,
    "the": 121,
    "front": 122,
    "desk:": 123,
    "sunny": 124,
    "with": 125,
    "clear": 126,
    "skies,": 127,
    "temperature": 128,
    "28\u00b0c.": 129,
    "completed:": 130,
    "order": 131,
    "has": 132,
    "been": 133,
    "placed": 134,
    "at": 135,
    "doorstep.": 136,
    "boost:": 137,
    "of": 138,
    "myr": 139,
    "327.62": 140,
    "to": 141,
    "shopeepay:": 142,
    "a": 143,
    "567.88": 144,
    "busonlineticket": 145,
    "completed.": 146,
    "3rd": 147,
    "party": 148,
    "rm": 149,
    "883.24": 150,
    "****7222/lee": 151,
    "on": 152,
    "29-may-2025,": 153,
    "23:54.": 154,
    "call": 155,
    "no": 156,
    "back": 157,
    "card": 158,
    "queries.": 159,
    "delivered.": 160,
    "check": 161,
    "porch.": 162,
    "1226.62": 163,
    "was": 164,
    "grabpay": 165,
    "wallet": 166,
    "used": 167,
    "pay": 168,
    "rm559.00": 169,
    "mydin.": 170,
    "is:": 171,
    "882345.": 172,
    "do": 173,
    "not": 174,
    "share": 175,
    "it": 176,
    "anyone.": 177,
    "available.": 178,
    "please": 179,
    "latest": 180,
    "version.": 181,
    "partly": 182,
    "cloudy,": 183,
    "salary": 184,
    "credited:": 185,
    "rm50.00": 186,
    "credited": 187,
    "account.": 188,
    "reminder:": 189,
    "you": 190,
    "have": 191,
    "meeting": 192,
    "starting": 193,
    "11:54": 194,
    "pm.": 195,
    "topic:": 196,
    "project": 197,
    "update.": 198,
    "otp": 199,
    "verification:": 200,
    "90127x.": 201,
    "valid": 202,
    "5": 203,
    "minutes.": 204,
    "paid": 205,
    "rm1248.00": 206,
    "airasia.": 207,
    "rm1102.84": 208,
    "836.00": 209,
    "today's": 210,
    "headline:": 211,
    "local": 212,
    "sports": 213,
    "team": 214,
    "wins": 215,
    "championship.": 216,
    "read": 217,
    "more": 218,
    "our": 219,
    "app.": 220,
    "949.08": 221,
    "****3741/time": 222,
    "2025-06-26,": 223,
    "01:59:45.": 224,
    "password": 225,
    "will": 226,
    "expire": 227,
    "in": 228,
    "14": 229,
    "days.": 230,
    "it.": 231,
    "friend": 232,
    "maya": 233,
    "liked": 234,
    "post.": 235,
    "mobile": 236,
    "running": 237,
    "low.": 238,
    "remaining:": 239,
    "150.50mb.": 240,
    "top": 241,
    "up": 242,
    "now!": 243,
    "rm1218.00": 244,
    "foodpanda.": 245,
    "charged": 246,
    "159.25": 247,
    "reload.": 248,
    "qr": 249,
    "36.84": 250,
    "2025-06-15,": 251,
    "07:33:45.": 252,
    "daily": 253,
    "step": 254,
    "goal": 255,
    "achieved!": 256,
    "walked": 257,
    "8,500": 258,
    "steps": 259,
    "today.": 260,
    "subang": 261,
    "jaya:": 262,
    "atm": 263,
    "withdrawal": 264,
    "alert:": 265,
    "withdrawn": 266,
    "from": 267,
    "mid": 268,
    "valley": 269,
    "using": 270,
    "ending": 271,
    "1026.": 272,
    "contact": 273,
    "if": 274,
    "this": 275,
    "wasn't": 276,
    "you.": 277,
    "1167.40": 278,
    "h&m": 279,
    "rm1276.13": 280,
    "debited": 281,
    "services.": 282,
    "out": 283,
    "delivery.": 284,
    "rm309.00": 285,
    "rm947.00": 286,
    "1178.29": 287,
    "****7584/digi": 288,
    "20/06/2025,": 289,
    "10:23:45.": 290,
    "azby10.": 291,
    "1301.00": 292,
    "successfully": 293,
    "transferred": 294,
    "grocer.": 295,
    "maintenance": 296,
    "occur": 297,
    "tonight": 298,
    "12:36": 299,
    "might": 300,
    "be": 301,
    "unavailable.": 302,
    "malaysia:": 303,
    "1203.06": 304,
    "deducted": 305,
    "ewallet.": 306,
    "reference": 307,
    "no.": 308,
    "651441473162": 309,
    "parcel": 310,
    "arrived": 311,
    "community": 312,
    "center,": 313,
    "pick": 314,
    "soon.": 315,
    "03:02": 316,
    "am.": 317,
    "rm421.22": 318,
    "time.": 319,
    "rm776.23": 320,
    "77.00": 321,
    "rm1011.00": 322,
    "shah": 323,
    "alam:": 324,
    "31\u00b0c.": 325,
    "425.14": 326,
    "lan.": 327,
    "10,000": 328,
    "16:06.": 329,
    "rm656.52": 330,
    "grab.": 331,
    "248.79": 332,
    "busonlineticket.": 333,
    "1486.14": 334,
    "aeon": 335,
    "384.64": 336,
    "****8337/goh": 337,
    "01:27:45": 338,
    "1000.97": 339,
    "****3813/siti": 340,
    "02/06/2025,": 341,
    "03:11:45": 342,
    "mae:": 343,
    "you've": 344,
    "437.51": 345,
    "tesco.": 346,
    "rm1110.81": 347,
    "aeon.": 348,
    "ahmad:": 349,
    "important": 350,
    "suspicious": 351,
    "login": 352,
    "attempt": 353,
    "detected": 354,
    "fpx": 355,
    "payment:": 356,
    "rm696.90": 357,
    "processed": 358,
    "successfully.": 359,
    "119.94": 360,
    "ang": 361,
    "kai": 362,
    "liang.": 363,
    "370.54": 364,
    "3500.00mb.": 365,
    "rm1076.24": 366,
    "rm560.51": 367,
    "mynews.": 368,
    "436.00": 369,
    "grab/****5080": 370,
    "-": 371,
    "370.03": 372,
    "20/06/2025": 373,
    "00:01.": 374,
    "3": 375,
    "1283.45": 376,
    "rm1438.10": 377,
    "starbucks.": 378,
    "846.78": 379,
    "rm1258.00": 380,
    "rm471.37": 381,
    "rm1475.21": 382,
    "rm1000.00": 383,
    "meps": 384,
    "trx": 385,
    "5189.": 386,
    "rm217.80": 387,
    "1349.84": 388,
    "celcom.": 389,
    "753.24": 390,
    "****3812/chen": 391,
    "mei": 392,
    "ling": 393,
    "22/06/2025,": 394,
    "23:15.": 395,
    "tech": 396,
    "breakthrough": 397,
    "announced.": 398,
    "kuala": 399,
    "lumpur:": 400,
    "rm1159.71": 401,
    "desk,": 402,
    "413.13": 403,
    "****5986/petronas": 404,
    "18-jun-2025,": 405,
    "10:37:45": 406,
    "rm1160.26": 407,
    "rm1307.17": 408,
    "familymart.": 409,
    "rm1098.40": 410,
    "astro.": 411,
    "11:39": 412,
    "13:21.": 413,
    "1316.92": 414,
    "****9642/siti": 415,
    "2025-06-19,": 416,
    "16:57.": 417,
    "225.00": 418,
    "malaysia.": 419,
    "rm1300.00": 420,
    "amazon": 421,
    "1000.00mb.": 422,
    "84.00": 423,
    "lazada.": 424,
    "1163.00": 425,
    "11:33": 426,
    "rm978.00": 427,
    "manager:": 428,
    "thanks": 429,
    "help": 430,
    "alex": 431,
    "04:38": 432,
    "1453.41": 433,
    "7-eleven.": 434,
    "budget": 435,
    "spent": 436,
    "rm3500.00": 437,
    "rm500": 438,
    "monthly": 439,
    "shopping.": 440,
    "500.00mb.": 441,
    "596.95": 442,
    "15/06/2025,": 443,
    "12:22:45": 444,
    "219.00": 445,
    "credit": 446,
    "limit": 447,
    "warning:": 448,
    "remaining": 449,
    "8200.": 450,
    "rm1460.00": 451,
    "familymart": 452,
    "1365.00": 453,
    "rm250.00": 454,
    "4621.": 455,
    "333.00": 456,
    "930.00": 457,
    "rm500.00": 458,
    "8437.": 459,
    "4259.": 460,
    "18:57.": 461,
    "01:43": 462,
    "06:49": 463,
    "one/****9468": 464,
    "649.00": 465,
    "18-jun-2025": 466,
    "18:40:45.": 467,
    "620.00": 468,
    "652.00": 469,
    "ismail.": 470,
    "668.00": 471,
    "rm447.00": 472,
    "296.00": 473,
    "berhad.": 474,
    "909.95": 475,
    "906.70": 476,
    "chen": 477,
    "rm362.00": 478,
    "bookstore.": 479,
    "rm1457.37": 480,
    "26.76": 481,
    "840.62": 482,
    "11-jun-2025,": 483,
    "07:05:45.": 484,
    "581.71": 485,
    "859.00": 486,
    "1003.05": 487,
    "895.00": 488,
    "sent": 489,
    "rm178.92": 490,
    "via": 491,
    "duitnow.": 492,
    "1387.39": 493,
    "19/06/2025,": 494,
    "00:36:45.": 495,
    "rm758.00": 496,
    "rm954.22": 497,
    "petronas": 498,
    "1487.00": 499,
    "512.00": 500,
    "7-eleven:": 501,
    "rm606.65": 502,
    "365747529563": 503,
    "112.04": 504,
    "2184.": 505,
    "1945.": 506,
    "several": 507,
    "unread": 508,
    "messages": 509,
    "inbox.": 510,
    "7066.": 511,
    "uniqlo:": 512,
    "380.72": 513,
    "305043502568": 514,
    "1150.95": 515,
    "****4258/tenaga": 516,
    "02:44:45": 517,
    "25\u00b0c.": 518,
    "rm324.00": 519,
    "airlines.": 520,
    "rm1000": 521,
    "failed:": 522,
    "rm150.50": 523,
    "could": 524,
    "processed.": 525,
    "2": 526,
    "69.70": 527,
    "rm1081.00": 528,
    "rm1267.53": 529,
    "258.32": 530,
    "douglas": 531,
    "ong": 532,
    "t": 533,
    "100.00": 534,
    "online": 535,
    "shop": 536,
    "341.67": 537,
    "liang": 538,
    "rm488.31": 539,
    "rm1454.00": 540,
    "h&m/****4365": 541,
    "rm1186.47": 542,
    "13/06/2025": 543,
    "05:50:45.": 544,
    "rm389.00": 545,
    "digi.": 546,
    "rm322.96": 547,
    "328.00": 548,
    "rm536.00": 549,
    "t.": 550,
    "897.55": 551,
    "rm1447.59": 552,
    "906.00": 553,
    "eng.": 554,
    "06:07": 555,
    "1077.70": 556,
    "maxis.": 557,
    "rm636.00": 558,
    "rm771.00": 559,
    "rm421.61": 560,
    "rm500.00.": 561,
    "01:03.": 562,
    "klcc": 563,
    "9004.": 564,
    "yin/****7757": 565,
    "rm1447.38": 566,
    "2025-06-02": 567,
    "20:14.": 568,
    "rm1059.44": 569,
    "13:38.": 570,
    "rm386.10": 571,
    "1175.27": 572,
    "1084.00": 573,
    "909.86": 574,
    "823.05": 575,
    "2025-05-29,": 576,
    "10:44:45.": 577,
    "790.08": 578,
    "jaya,": 579,
    "rm250.00.": 580,
    "rm970.69": 581,
    "2582.": 582,
    "rm1412.42": 583,
    "10:58.": 584,
    "rm1292.39": 585,
    "shopee:": 586,
    "1243.00": 587,
    "946413807415": 588,
    "refund": 589,
    "processed:": 590,
    "rahman": 591,
    "rm654.39": 592,
    "petronas.": 593,
    "12,345": 594,
    "684.00": 595,
    "850.63": 596,
    "1434.00": 597,
    "891.00": 598,
    "guardian.": 599,
    "rm852.04": 600,
    "1028.45": 601,
    "ying.": 602,
    "744.49": 603,
    "kfc.": 604,
    "17:56.": 605,
    "rm15.05": 606,
    "overcast": 607,
    "chance": 608,
    "rain,": 609,
    "center:": 610,
    "ismail/****4877": 611,
    "rm1268.94": 612,
    "28-may-2025": 613,
    "01:22:45": 614,
    "497.40": 615,
    "ying/****1055": 616,
    "658.80": 617,
    "2025-05-28": 618,
    "00:45:45.": 619,
    "rm1351.00": 620,
    "rm1234.00": 621,
    "697.05": 622,
    "****5765/seamoney": 623,
    "2025-06-18,": 624,
    "12:53.": 625,
    "rm50.00.": 626,
    "dining.": 627,
    "5203.": 628,
    "rm1384.90": 629,
    "nurhaliza.": 630,
    "shop.": 631,
    "rm1092.78": 632,
    "521.00": 633,
    "337.93": 634,
    "11:35:45.": 635,
    "rm1403.58": 636,
    "rm887.95": 637,
    "136.95": 638,
    "****8713/uniqlo": 639,
    "05:58:45.": 640,
    "shopee.": 641,
    "7": 642,
    "109.33": 643,
    "watsons.": 644,
    "552.04": 645,
    "****9045/grabfood": 646,
    "28-may-2025,": 647,
    "06:21:45": 648,
    "148.31": 649,
    "rm1048.39": 650,
    "rm195.31": 651,
    "maxis:": 652,
    "rm245.07": 653,
    "582204790801": 654,
    "05:32": 655,
    "rm535.11": 656,
    "rm418.64": 657,
    "1469.38": 658,
    "airlines": 659,
    "rm234.23": 660,
    "tealive.": 661,
    "familymart:": 662,
    "rm150.11": 663,
    "611939775626": 664,
    "rm141.65": 665,
    "rm1263.00": 666,
    "shell.": 667,
    "rm432.53": 668,
    "transport.": 669,
    "mrt:": 670,
    "1427.35": 671,
    "190720399331": 672,
    "734.00": 673,
    "rm708.68": 674,
    "john:": 675,
    "can": 676,
    "we": 677,
    "meet": 678,
    "tomorrow?": 679,
    "12:47": 680,
    "931.00": 681,
    "rm435.37": 682,
    "rm1265.14": 683,
    "03:42.": 684,
    "rm648.83": 685,
    "789.00": 686,
    "1457.65": 687,
    "03:27": 688,
    "rm569.64": 689,
    "549.63": 690,
    "369.78": 691,
    "speedmart:": 692,
    "rm730.24": 693,
    "678727813523": 694,
    "107.00": 695,
    "rm1310.97": 696,
    "mrt.": 697,
    "giant:": 698,
    "363.15": 699,
    "913823251652": 700,
    "218.63": 701,
    "1495.63": 702,
    "rm126.00": 703,
    "rm1299.52": 704,
    "613273608033": 705,
    "rm857.38": 706,
    "1495.27": 707,
    "1161.": 708,
    "158.28": 709,
    "rm1366.72": 710,
    "1294.00": 711,
    "****3831/siti": 712,
    "2025-06-02,": 713,
    "00:31:45.": 714,
    "987.67": 715,
    "420.00": 716,
    "1019.00": 717,
    "4365.": 718,
    "rm1499.98": 719,
    "rm432.71": 720,
    "935.76": 721,
    "5496.": 722,
    "217.84": 723,
    "349.00": 724,
    "rm899.00": 725,
    "lumpur,": 726,
    "973.87": 727,
    "190.00": 728,
    "sarah:": 729,
    "1258.85": 730,
    "rm584.57": 731,
    "1228.52": 732,
    "103.33": 733,
    "1315.02": 734,
    "ling.": 735,
    "969.54": 736,
    "rm106.00": 737,
    "817.10": 738,
    "****6971/tan": 739,
    "20:05:45.": 740,
    "180.90": 741,
    "1425.00": 742,
    "grabfood.": 743,
    "ling:": 744,
    "rm1064.87": 745,
    "768305513340": 746,
    "rm1088.72": 747,
    "145.00": 748,
    "03/06/2025,": 749,
    "05:24:45": 750,
    "rm1294.18": 751,
    "1190.53": 752,
    "rm332.00": 753,
    "yin.": 754,
    "1130.89": 755,
    "****4620/telekom": 756,
    "2025-06-08,": 757,
    "04:26.": 758,
    "ling/****6568": 759,
    "rm1235.38": 760,
    "16-jun-2025": 761,
    "09:47.": 762,
    "rm461.31": 763,
    "237277485201": 764,
    "858.53": 765,
    "3140.": 766,
    "138.00": 767,
    "rm1441.43": 768,
    "rm344.00": 769,
    "119.69": 770,
    "rm347.20": 771,
    "1050.32": 772,
    "wei.": 773,
    "grocer/****5620": 774,
    "1268.00": 775,
    "08-jun-2025": 776,
    "10:23.": 777,
    "1410.10": 778,
    "261.08": 779,
    "****4069/astro": 780,
    "08:06:45": 781,
    "16:12.": 782,
    "rm783.00": 783,
    "1247.00": 784,
    "rm663.75": 785,
    "22.00": 786,
    "1294.15": 787,
    "speedmart.": 788,
    "64.00": 789,
    "14-jun-2025,": 790,
    "03:16:45.": 791,
    "rm1450.00": 792,
    "rm1107.50": 793,
    "rm1213.00": 794,
    "malaysia/****3453": 795,
    "301.00": 796,
    "09-jun-2025": 797,
    "02:55:45": 798,
    "rm641.09": 799,
    "1208.02": 800,
    "25-jun-2025,": 801,
    "04:05:45.": 802,
    "542.24": 803,
    "2228.": 804,
    "1199.05": 805,
    "160.83": 806,
    "09-jun-2025,": 807,
    "01:41:45": 808,
    "rm724.16": 809,
    "1029.99": 810,
    "1197.00": 811,
    "697.00": 812,
    "10:40": 813,
    "1432.80": 814,
    "rm868.93": 815,
    "rm1429.11": 816,
    "rm78.49": 817,
    "rm1079.00": 818,
    "rm966.79": 819,
    "542.00": 820,
    "wei/****4843": 821,
    "355.49": 822,
    "12:59:45.": 823,
    "rm411.55": 824,
    "270.00": 825,
    "15-jun-2025,": 826,
    "04:24.": 827,
    "35.64": 828,
    "rm767.00": 829,
    "1360.67": 830,
    "2231.": 831,
    "rm1287.00": 832,
    "619.48": 833,
    "shell/****5338": 834,
    "115.39": 835,
    "11/06/2025": 836,
    "07:35.": 837,
    "rm1156.94": 838,
    "1091.76": 839,
    "amazon.": 840,
    "rm312.00": 841,
    "02:33.": 842,
    "244.00": 843,
    "50.00mb.": 844,
    "rm436.13": 845,
    "rm1489.00": 846,
    "rm398.00": 847,
    "rm881.71": 848,
    "188.00": 849,
    "1458.65": 850,
    "04-jun-2025,": 851,
    "09:29:45.": 852,
    "rm187.28": 853,
    "668.03": 854,
    "one.": 855,
    "11:43.": 856,
    "rm1270.00": 857,
    "1149.00": 858,
    "****7958/lee": 859,
    "13-jun-2025,": 860,
    "02:05:45": 861,
    "1002.00": 862,
    "06-jun-2025,": 863,
    "06:22:45": 864,
    "5553.": 865,
    "54.00": 866,
    "****4179/google": 867,
    "2025-05-30,": 868,
    "09:40.": 869,
    "1610.": 870,
    "571.00": 871,
    "1232.00": 872,
    "jaya.": 873,
    "digi:": 874,
    "rm991.00": 875,
    "754084125765": 876,
    "rm761.32": 877,
    "01:57.": 878,
    "rm637.40": 879,
    "yin:": 880,
    "831567513066": 881,
    "rm256.00": 882,
    "864.31": 883,
    "****8639/busonlineticket": 884,
    "00:50.": 885,
    "rm462.00": 886,
    "03:47": 887,
    "rm1412.00": 888,
    "661.96": 889,
    "rm436.21": 890,
    "282.00": 891,
    "rm861.44": 892,
    "rm832.00": 893,
    "981.00": 894,
    "****7884/grab": 895,
    "26/06/2025,": 896,
    "21:34:45.": 897,
    "rm1012.88": 898,
    "alam,": 899,
    "rm1293.63": 900,
    "bookstore:": 901,
    "rm1272.70": 902,
    "922865683567": 903,
    "watsons/****5681": 904,
    "rm142.18": 905,
    "2025-06-23": 906,
    "21:15:45.": 907,
    "rm69.50": 908,
    "mcdonald's.": 909,
    "9981.": 910,
    "rm553.01": 911,
    "618.48": 912,
    "479.95": 913,
    "rm146.43": 914,
    "6007.": 915,
    "2858.": 916,
    "rm315.53": 917,
    "21:39.": 918,
    "3350.": 919,
    "09:25": 920,
    "849.00": 921,
    "****4686/goh": 922,
    "25/06/2025,": 923,
    "02:15.": 924,
    "rm672.42": 925,
    "rm775.68": 926,
    "rm454.80": 927,
    "rm588.00": 928,
    "rm1202.50": 929,
    "15:14.": 930,
    "rm1442.00": 931,
    "667882119195": 932,
    "722.26": 933,
    "04:20": 934,
    "rm16.56": 935,
    "1089.00": 936,
    "1377.00": 937,
    "593.27": 938,
    "435.08": 939,
    "rm1318.50": 940,
    "rm1032.52": 941,
    "4344.": 942,
    "rm540.00": 943,
    "08:44": 944,
    "services:": 945,
    "rm1456.54": 946,
    "246013024629": 947,
    "rm1434.42": 948,
    "rm14.37": 949,
    "rm139.09": 950,
    "rm1449.89": 951,
    "rm899.29": 952,
    "02:03": 953,
    "bookstore/****6633": 954,
    "rm398.25": 955,
    "13-jun-2025": 956,
    "04:22:45": 957,
    "639.13": 958,
    "****7228/kfc": 959,
    "01:47:45": 960,
    "819.28": 961,
    "mcdonald's/****1614": 962,
    "1261.00": 963,
    "14/06/2025": 964,
    "07:19:45": 965,
    "1078.23": 966,
    "rm1243.00": 967,
    "902.31": 968,
    "01:06.": 969,
    "801.69": 970,
    "02:14.": 971,
    "936.88": 972,
    "267.16": 973,
    "393.26": 974,
    "730.04": 975,
    "1187.00": 976,
    "rm1461.00": 977,
    "16:21.": 978,
    "512.80": 979,
    "shopee/****5407": 980,
    "390.00": 981,
    "26-jun-2025": 982,
    "04:45:45.": 983,
    "20:02.": 984,
    "596.38": 985,
    "6139.": 986,
    "833.00": 987,
    "455.03": 988,
    "****2801/white": 989,
    "24/06/2025,": 990,
    "21:55:45.": 991,
    "rm1233.85": 992,
    "rm1402.36": 993,
    "06:57": 994,
    "8945.": 995,
    "1480.09": 996,
    "rm769.66": 997,
    "rm868.09": 998,
    "rm3500.00.": 999,
    "rm1142.45": 1000,
    "digi/****2677": 1001,
    "52.00": 1002,
    "2025-06-05": 1003,
    "03:05:45.": 1004,
    "1204.65": 1005,
    "1242.00": 1006,
    "657.00": 1007,
    "139.28": 1008,
    "3.23": 1009,
    "1126.77": 1010,
    "rm60.88": 1011,
    "rm87.78": 1012,
    "grab/****1532": 1013,
    "rm355.83": 1014,
    "2025-06-09": 1015,
    "14:53:45.": 1016,
    "rm925.79": 1017,
    "08:55.": 1018,
    "rm392.00": 1019,
    "872.66": 1020,
    "giant.": 1021,
    "01:53.": 1022,
    "12:06": 1023,
    "778.92": 1024,
    "76.00": 1025,
    "rm912.62": 1026,
    "11/06/2025,": 1027,
    "10:55:45": 1028,
    "742.40": 1029,
    "****8589/popular": 1030,
    "2025-06-23,": 1031,
    "10:14:45.": 1032,
    "01:30": 1033,
    "lazada:": 1034,
    "rm1002.72": 1035,
    "960750978044": 1036,
    "1395.59": 1037,
    "1409.72": 1038,
    "6845.": 1039,
    "1113.79": 1040,
    "rm1003.00": 1041,
    "18.91": 1042,
    "rm116.94": 1043,
    "1323.95": 1044,
    "rm1432.73": 1045,
    "mcdonald's/****3534": 1046,
    "rm777.05": 1047,
    "10:35:45": 1048,
    "rm200": 1049,
    "rm191.80": 1050,
    "05:23.": 1051,
    "rm63.00": 1052,
    "rm770.23": 1053,
    "rm342.26": 1054,
    "1803.": 1055,
    "rm1201.13": 1056,
    "rm127.00": 1057,
    "1400.00": 1058,
    "1466.63": 1059,
    "****4799/99": 1060,
    "08/06/2025,": 1061,
    "11:32.": 1062,
    "18.79": 1063,
    "****9112/aeon": 1064,
    "13:16.": 1065,
    "02:23": 1066,
    "rm558.05": 1067,
    "ismail/****6128": 1068,
    "1107.63": 1069,
    "01/06/2025": 1070,
    "02:59:45": 1071,
    "rm369.06": 1072,
    "584.00": 1073,
    "1281.00": 1074,
    "rm490.86": 1075,
    "1425.75": 1076,
    "grabfood:": 1077,
    "1436.00": 1078,
    "438713985078": 1079,
    "rm638.00": 1080,
    "rm647.92": 1081,
    "rm1444.32": 1082,
    "reload/****9656": 1083,
    "892.71": 1084,
    "2025-06-24": 1085,
    "23:51.": 1086,
    "rm542.35": 1087,
    "rm537.27": 1088,
    "2508.": 1089,
    "398.76": 1090,
    "661.63": 1091,
    "ying:": 1092,
    "rm48.67": 1093,
    "519305081130": 1094,
    "1394.46": 1095,
    "rm36.11": 1096,
    "rm197.28": 1097,
    "1068.34": 1098,
    "1320.24": 1099,
    "250.00mb.": 1100,
    "rm407.00": 1101,
    "1343.76": 1102,
    "rm1429.29": 1103,
    "907.51": 1104,
    "1307.00": 1105,
    "480.00": 1106,
    "time/****6680": 1107,
    "rm216.15": 1108,
    "30-may-2025": 1109,
    "rm68.48": 1110,
    "uniqlo.": 1111,
    "rm1264.00": 1112,
    "rm1155.00": 1113,
    "925.93": 1114,
    "22:13:45.": 1115,
    "267.42": 1116,
    "7-eleven/****8560": 1117,
    "150.81": 1118,
    "19/06/2025": 1119,
    "10:56:45": 1120,
    "reload/****7845": 1121,
    "657.08": 1122,
    "25/06/2025": 1123,
    "08:15:45.": 1124,
    "rm1097.00": 1125,
    "6.00": 1126,
    "156.85": 1127,
    "****5328/telekom": 1128,
    "10:10.": 1129,
    "nurhaliza/****1375": 1130,
    "rm1009.44": 1131,
    "2025-06-03": 1132,
    "00:08.": 1133,
    "1216.09": 1134,
    "rm615.03": 1135,
    "rm823.57": 1136,
    "623.98": 1137,
    "****1160/google": 1138,
    "02:41:45": 1139,
    "rm187.00": 1140,
    "rm542.06": 1141,
    "1125.00": 1142,
    "rm677.68": 1143,
    "1437.36": 1144,
    "883.13": 1145,
    "756.27": 1146,
    "533.19": 1147,
    "familymart/****6781": 1148,
    "rm1402.00": 1149,
    "22:10:45.": 1150,
    "rm719.79": 1151,
    "rm1167.00": 1152,
    "578.00": 1153,
    "762.07": 1154,
    "1404.89": 1155,
    "287.04": 1156,
    "rm933.00": 1157,
    "rm878.73": 1158,
    "rm207.00": 1159,
    "rm1315.46": 1160,
    "1398.00": 1161,
    "990668324694": 1162,
    "rm1311.00": 1163,
    "rm1424.00": 1164,
    "rm540.47": 1165,
    "1262.00": 1166,
    "930.46": 1167,
    "887.76": 1168,
    "rm3.27": 1169,
    "01:55": 1170,
    "5671.": 1171,
    "rm902.00": 1172,
    "160931226700": 1173,
    "1122.00": 1174,
    "8287.": 1175,
    "312.00": 1176,
    "rm117.08": 1177,
    "rm465.32": 1178,
    "814655130086": 1179,
    "6627.": 1180,
    "9320.": 1181,
    "402.00": 1182,
    "05/06/2025,": 1183,
    "02:19:45": 1184,
    "979.06": 1185,
    "****6669/lee": 1186,
    "06/06/2025,": 1187,
    "03:43:45": 1188,
    "aeon/****3834": 1189,
    "749.51": 1190,
    "14-jun-2025": 1191,
    "05:54:45": 1192,
    "rm7.74": 1193,
    "rm649.58": 1194,
    "444.24": 1195,
    "1494.07": 1196,
    "02-jun-2025,": 1197,
    "19:29.": 1198,
    "1136.14": 1199,
    "rm1188.11": 1200,
    "rm970.36": 1201,
    "1302.98": 1202,
    "30/05/2025,": 1203,
    "16:37:45.": 1204,
    "t:": 1205,
    "rm1205.94": 1206,
    "544732262352": 1207,
    "grabfood/****7254": 1208,
    "181.34": 1209,
    "2025-06-15": 1210,
    "04:11:45": 1211,
    "861.53": 1212,
    "1096.03": 1213,
    "****8913/seamoney": 1214,
    "28/05/2025,": 1215,
    "21:19:45.": 1216,
    "rm183.00": 1217,
    "aeon:": 1218,
    "341.00": 1219,
    "646947161188": 1220,
    "rm497.00": 1221,
    "292.00": 1222,
    "2025-06-25,": 1223,
    "06:53:45.": 1224,
    "rm714.00": 1225,
    "05:27.": 1226,
    "t/****3136": 1227,
    "1400.86": 1228,
    "2025-06-13": 1229,
    "14:28.": 1230,
    "07:46": 1231,
    "rm367.69": 1232,
    "331.00": 1233,
    "rm384.31": 1234,
    "791.00": 1235,
    "1096.29": 1236,
    "rm95.54": 1237,
    "celcom:": 1238,
    "rm1108.00": 1239,
    "526103971876": 1240,
    "1227.00": 1241,
    "649.74": 1242,
    "03:49": 1243,
    "rm351.69": 1244,
    "8374.": 1245,
    "1003.00": 1246,
    "888.74": 1247,
    "691792100132": 1248,
    "381.66": 1249,
    "10:30:45.": 1250,
    "guardian:": 1251,
    "rm703.88": 1252,
    "968991040735": 1253,
    "rm1422.29": 1254,
    "rm755.23": 1255,
    "rm1477.36": 1256,
    "898.34": 1257,
    "309.00": 1258,
    "468.00": 1259,
    "****6005/tenaga": 1260,
    "03:15.": 1261,
    "rm474.00": 1262,
    "781.48": 1263,
    "rm1062.98": 1264,
    "9.00": 1265,
    "rm14.45": 1266,
    "1386.53": 1267,
    "445.00": 1268,
    "1947.": 1269,
    "4806.": 1270,
    "1471.36": 1271,
    "21-jun-2025,": 1272,
    "09:03:45": 1273,
    "rm1180.35": 1274,
    "236.81": 1275,
    "500.79": 1276,
    "424.67": 1277,
    "218.83": 1278,
    "****8580/goh": 1279,
    "2025-06-14,": 1280,
    "02:02.": 1281,
    "18:18.": 1282,
    "555.30": 1283,
    "179.91": 1284,
    "rm417.51": 1285,
    "1483.49": 1286,
    "rm473.00": 1287,
    "220.00": 1288,
    "23-jun-2025,": 1289,
    "16:05:45.": 1290,
    "rm660.84": 1291,
    "90.00": 1292,
    "rm1113.00": 1293,
    "932.67": 1294,
    "rm532.00": 1295,
    "23.96": 1296,
    "2701.": 1297,
    "1230.62": 1298,
    "rm50.52": 1299,
    "475.74": 1300,
    "malaysia/****2350": 1301,
    "30/05/2025": 1302,
    "07:52:45": 1303,
    "07:16": 1304,
    "1436.01": 1305,
    "309.91": 1306,
    "12-jun-2025,": 1307,
    "02:05.": 1308,
    "rm915.64": 1309,
    "rm1369.73": 1310,
    "3286.": 1311,
    "1480.00": 1312,
    "rm196.00": 1313,
    "rm744.70": 1314,
    "106.38": 1315,
    "foodpanda:": 1316,
    "1421.56": 1317,
    "190942283944": 1318,
    "rm694.83": 1319,
    "11:00.": 1320,
    "271.19": 1321,
    "rm1232.38": 1322,
    "1087.46": 1323,
    "2283.": 1324,
    "rm989.00": 1325,
    "600.59": 1326,
    "rm281.12": 1327,
    "rm1028.33": 1328,
    "rm183.77": 1329,
    "48.65": 1330,
    "527.00": 1331,
    "823.44": 1332,
    "****1421/mcdonald's": 1333,
    "2025-06-13,": 1334,
    "04:09:45": 1335,
    "rm303.22": 1336,
    "615.07": 1337,
    "rm243.12": 1338,
    "890.00": 1339,
    "183.73": 1340,
    "03:22": 1341,
    "1259.43": 1342,
    "193.70": 1343,
    "45.37": 1344,
    "rm611.08": 1345,
    "rm1469.60": 1346,
    "302213562736": 1347,
    "395.65": 1348,
    "496.08": 1349,
    "2657.": 1350,
    "667.38": 1351,
    "rm458.00": 1352,
    "ling/****4619": 1353,
    "1302.95": 1354,
    "12:37:45.": 1355,
    "165.00": 1356,
    "5404.": 1357,
    "1191.22": 1358,
    "662.19": 1359,
    "383.70": 1360,
    "shell/****9945": 1361,
    "634.00": 1362,
    "2025-06-26": 1363,
    "02:03:45": 1364,
    "rm1090.47": 1365,
    "rm985.00": 1366,
    "rm149.15": 1367,
    "597.00": 1368,
    "astro/****6473": 1369,
    "450.52": 1370,
    "09/06/2025": 1371,
    "09:33:45.": 1372,
    "1130.00": 1373,
    "rm423.00": 1374,
    "1207.00": 1375,
    "23:12.": 1376,
    "rm1154.00": 1377,
    "977.00": 1378,
    "****3180/tng": 1379,
    "2025-06-17,": 1380,
    "12:58:45.": 1381,
    "4617.": 1382,
    "742.73": 1383,
    "****8089/familymart": 1384,
    "08:04:45": 1385,
    "650.21": 1386,
    "14:03.": 1387,
    "829.00": 1388,
    "787.81": 1389,
    "4938.": 1390,
    "04:04.": 1391,
    "1162.09": 1392,
    "09/06/2025,": 1393,
    "10:11:45.": 1394,
    "rm1277.92": 1395,
    "1124.16": 1396,
    "****2276/mydin": 1397,
    "06:22:45.": 1398,
    "rm784.00": 1399,
    "568.55": 1400,
    "rm929.14": 1401,
    "986.00": 1402,
    "1050.00": 1403,
    "rm319.61": 1404,
    "796.89": 1405,
    "****6288/mrt": 1406,
    "21:26:45.": 1407,
    "162.00": 1408,
    "427.58": 1409,
    "rm199.90": 1410,
    "1304.96": 1411,
    "23:19:45.": 1412,
    "1493.00": 1413,
    "berhad:": 1414,
    "rm400.00": 1415,
    "587767583727": 1416,
    "1022.49": 1417,
    "04:30:45.": 1418,
    "655.74": 1419,
    "bookstore/****6257": 1420,
    "1424.00": 1421,
    "31/05/2025": 1422,
    "06:11:45": 1423,
    "rm713.11": 1424,
    "435.54": 1425,
    "rm1267.19": 1426,
    "649347021984": 1427,
    "1092.00": 1428,
    "10:06:45.": 1429,
    "352.80": 1430,
    "7335.": 1431,
    "rm568.25": 1432,
    "876.42": 1433,
    "530.00": 1434,
    "rm790.72": 1435,
    "834.00": 1436,
    "rm922.00": 1437,
    "07:56.": 1438,
    "41.68": 1439,
    "****2588/apple": 1440,
    "15:57:45.": 1441,
    "247.53": 1442,
    "200.82": 1443,
    "169.92": 1444,
    "rm598.82": 1445,
    "932658280498": 1446,
    "rm831.05": 1447,
    "rm1017.44": 1448,
    "rm74.20": 1449,
    "rm397.82": 1450,
    "rm1474.17": 1451,
    "rm346.00": 1452,
    "5986.": 1453,
    "1015.24": 1454,
    "1089.93": 1455,
    "1384.29": 1456,
    "1487.22": 1457,
    "779.10": 1458,
    "rm1082.00": 1459,
    "1196.55": 1460,
    "967.49": 1461,
    "839.00": 1462,
    "06:00:45.": 1463,
    "04:55.": 1464,
    "shell:": 1465,
    "1053.37": 1466,
    "174354674057": 1467,
    "791.18": 1468,
    "9017.": 1469,
    "324.06": 1470,
    "****2206/mcdonald's": 1471,
    "20-jun-2025,": 1472,
    "11:49.": 1473,
    "rm1052.68": 1474,
    "rm479.50": 1475,
    "rm808.87": 1476,
    "360.00": 1477,
    "rm521.26": 1478,
    "1249.00": 1479,
    "tesco:": 1480,
    "rm599.21": 1481,
    "598127503989": 1482,
    "tealive:": 1483,
    "rm1364.96": 1484,
    "813900543912": 1485,
    "183.00": 1486,
    "2555.": 1487,
    "1307.96": 1488,
    "rm1091.74": 1489,
    "rm1000.13": 1490,
    "1151.00": 1491,
    "rm670.49": 1492,
    "familymart/****7431": 1493,
    "787.16": 1494,
    "27/05/2025": 1495,
    "02:35.": 1496,
    "rm1299.00": 1497,
    "1012.88": 1498,
    "106917291190": 1499,
    "rm902.18": 1500,
    "h&m.": 1501,
    "****1978/malaysia": 1502,
    "03-jun-2025,": 1503,
    "05:44:45.": 1504,
    "634.52": 1505,
    "****7293/goh": 1506,
    "15:34.": 1507,
    "17.89": 1508,
    "186.00": 1509,
    "498.00": 1510,
    "09:38.": 1511,
    "7896.": 1512,
    "944.00": 1513,
    "****6856/foodpanda": 1514,
    "18/06/2025,": 1515,
    "20:50:45.": 1516,
    "626.67": 1517,
    "speedmart/****1127": 1518,
    "rm1286.00": 1519,
    "2025-06-20": 1520,
    "07:37:45.": 1521,
    "rm658.70": 1522,
    "377.93": 1523,
    "****9014/white": 1524,
    "19:28:45.": 1525,
    "airlines:": 1526,
    "rm595.00": 1527,
    "541307674369": 1528,
    "rm1067.00": 1529,
    "rm962.46": 1530,
    "6138.": 1531,
    "rm855.00": 1532,
    "1390.00": 1533,
    "378563054554": 1534,
    "1456.00": 1535,
    "478.30": 1536,
    "1034.00": 1537,
    "rm409.89": 1538,
    "1369.00": 1539,
    "rm1204.00": 1540,
    "ismail/****5038": 1541,
    "rm839.52": 1542,
    "2025-05-29": 1543,
    "17:24:45.": 1544,
    "shell/****5923": 1545,
    "761.66": 1546,
    "17/06/2025": 1547,
    "11:07:45.": 1548,
    "388.00": 1549,
    "rm798.00": 1550,
    "05:40": 1551,
    "1324.44": 1552,
    "860.09": 1553,
    "19-jun-2025,": 1554,
    "12:03:45.": 1555,
    "rm624.90": 1556,
    "888.00": 1557,
    "rm524.97": 1558,
    "536.33": 1559,
    "1180.03": 1560,
    "airasia/****7182": 1561,
    "922.74": 1562,
    "03:24.": 1563,
    "830.77": 1564,
    "rm281.79": 1565,
    "uniqlo/****7985": 1566,
    "rm1186.83": 1567,
    "2025-06-01": 1568,
    "05:10:45": 1569,
    "rm689.99": 1570,
    "385.00": 1571,
    "1400.61": 1572,
    "giant/****8135": 1573,
    "rm1161.95": 1574,
    "15-jun-2025": 1575,
    "10:43:45": 1576,
    "1293.53": 1577,
    "1428.00": 1578,
    "612.00": 1579,
    "3991.": 1580,
    "rm582.10": 1581,
    "rm1000.00.": 1582,
    "rm1418.79": 1583,
    "351.00": 1584,
    "rm1078.00": 1585,
    "833.98": 1586,
    "one/****5797": 1587,
    "33.00": 1588,
    "2025-06-16": 1589,
    "07:11:45.": 1590,
    "rm593.00": 1591,
    "1386.97": 1592,
    "rm903.00": 1593,
    "rm396.97": 1594,
    "rm817.42": 1595,
    "ying/****4495": 1596,
    "rm417.00": 1597,
    "16/06/2025": 1598,
    "11:53:45.": 1599,
    "1175.94": 1600,
    "261422892543": 1601,
    "rm1305.98": 1602,
    "509.15": 1603,
    "4279.": 1604,
    "566.09": 1605,
    "745.96": 1606,
    "08:35": 1607,
    "rm1466.80": 1608,
    "7848.": 1609,
    "1068.96": 1610,
    "1427.26": 1611,
    "aeon/****1235": 1612,
    "rm937.00": 1613,
    "15:00.": 1614,
    "rm1145.76": 1615,
    "01:39": 1616,
    "758.18": 1617,
    "401.46": 1618,
    "176.32": 1619,
    "rm1291.74": 1620,
    "rm244.27": 1621,
    "rm881.00": 1622,
    "rm748.00": 1623,
    "rm478.44": 1624,
    "717.26": 1625,
    "rm1386.29": 1626,
    "1437.00": 1627,
    "rm683.19": 1628,
    "rm232.26": 1629
  },
  "idx2word": [
    "<PAD>",
    "<UNK>",
    "verification",
    "code",
    "social",
    "update",
    "account",
    "activity",
    "payment",
    "debit",
    "alert",
    "transaction",
    "completed",
    "cimb",
    "to:",
    "tan",
    "soon",
    "lan",
    "system",
    "notification",
    "package",
    "delivery",
    "security",
    "weather",
    "reminder",
    "data",
    "usage",
    "news",
    "calendar",
    "health",
    "foodpanda",
    "bank",
    "islam",
    "new",
    "message",
    "connectivity",
    "transfer",
    "successful.",
    "purchase",
    "confirmation",
    "digi",
    "successful",
    "mcdonald's",
    "gxbank",
    "duitnow",
    "shell",
    "apple",
    "services",
    "rhb",
    "app",
    "hong",
    "leong",
    "white",
    "curry",
    "mee",
    "selayang",
    "restoran",
    "kam",
    "ying",
    "maybank",
    "grab",
    "ahmad",
    "bin",
    "ismail",
    "public",
    "seamoney",
    "capital",
    "malaysia",
    "ambank",
    "tesco",
    "goh",
    "ru",
    "yin",
    "astro",
    "starbucks",
    "tng",
    "reload",
    "shopee",
    "mrt",
    "7-eleven",
    "tealive",
    "airasia",
    "celcom",
    "mydin",
    "tenaga",
    "nasional",
    "berhad",
    "mynews",
    "alliance",
    "rides-ec",
    "petaling",
    "jaya",
    "lim",
    "guan",
    "eng",
    "time",
    "siti",
    "nurhaliza",
    "grabfood",
    "watsons",
    "telekom",
    "guardian",
    "maxis",
    "grocer",
    "kfc",
    "99",
    "speedmart",
    "uniqlo",
    "lee",
    "wei",
    "popular",
    "bookstore",
    "google",
    "one",
    "lazada",
    "your",
    "balance",
    "is",
    "rm150.50.",
    "forecast",
    "for",
    "the",
    "front",
    "desk:",
    "sunny",
    "with",
    "clear",
    "skies,",
    "temperature",
    "28\u00b0c.",
    "completed:",
    "order",
    "has",
    "been",
    "placed",
    "at",
    "doorstep.",
    "boost:",
    "of",
    "myr",
    "327.62",
    "to",
    "shopeepay:",
    "a",
    "567.88",
    "busonlineticket",
    "completed.",
    "3rd",
    "party",
    "rm",
    "883.24",
    "****7222/lee",
    "on",
    "29-may-2025,",
    "23:54.",
    "call",
    "no",
    "back",
    "card",
    "queries.",
    "delivered.",
    "check",
    "porch.",
    "1226.62",
    "was",
    "grabpay",
    "wallet",
    "used",
    "pay",
    "rm559.00",
    "mydin.",
    "is:",
    "882345.",
    "do",
    "not",
    "share",
    "it",
    "anyone.",
    "available.",
    "please",
    "latest",
    "version.",
    "partly",
    "cloudy,",
    "salary",
    "credited:",
    "rm50.00",
    "credited",
    "account.",
    "reminder:",
    "you",
    "have",
    "meeting",
    "starting",
    "11:54",
    "pm.",
    "topic:",
    "project",
    "update.",
    "otp",
    "verification:",
    "90127x.",
    "valid",
    "5",
    "minutes.",
    "paid",
    "rm1248.00",
    "airasia.",
    "rm1102.84",
    "836.00",
    "today's",
    "headline:",
    "local",
    "sports",
    "team",
    "wins",
    "championship.",
    "read",
    "more",
    "our",
    "app.",
    "949.08",
    "****3741/time",
    "2025-06-26,",
    "01:59:45.",
    "password",
    "will",
    "expire",
    "in",
    "14",
    "days.",
    "it.",
    "friend",
    "maya",
    "liked",
    "post.",
    "mobile",
    "running",
    "low.",
    "remaining:",
    "150.50mb.",
    "top",
    "up",
    "now!",
    "rm1218.00",
    "foodpanda.",
    "charged",
    "159.25",
    "reload.",
    "qr",
    "36.84",
    "2025-06-15,",
    "07:33:45.",
    "daily",
    "step",
    "goal",
    "achieved!",
    "walked",
    "8,500",
    "steps",
    "today.",
    "subang",
    "jaya:",
    "atm",
    "withdrawal",
    "alert:",
    "withdrawn",
    "from",
    "mid",
    "valley",
    "using",
    "ending",
    "1026.",
    "contact",
    "if",
    "this",
    "wasn't",
    "you.",
    "1167.40",
    "h&m",
    "rm1276.13",
    "debited",
    "services.",
    "out",
    "delivery.",
    "rm309.00",
    "rm947.00",
    "1178.29",
    "****7584/digi",
    "20/06/2025,",
    "10:23:45.",
    "azby10.",
    "1301.00",
    "successfully",
    "transferred",
    "grocer.",
    "maintenance",
    "occur",
    "tonight",
    "12:36",
    "might",
    "be",
    "unavailable.",
    "malaysia:",
    "1203.06",
    "deducted",
    "ewallet.",
    "reference",
    "no.",
    "651441473162",
    "parcel",
    "arrived",
    "community",
    "center,",
    "pick",
    "soon.",
    "03:02",
    "am.",
    "rm421.22",
    "time.",
    "rm776.23",
    "77.00",
    "rm1011.00",
    "shah",
    "alam:",
    "31\u00b0c.",
    "425.14",
    "lan.",
    "10,000",
    "16:06.",
    "rm656.52",
    "grab.",
    "248.79",
    "busonlineticket.",
    "1486.14",
    "aeon",
    "384.64",
    "****8337/goh",
    "01:27:45",
    "1000.97",
    "****3813/siti",
    "02/06/2025,",
    "03:11:45",
    "mae:",
    "you've",
    "437.51",
    "tesco.",
    "rm1110.81",
    "aeon.",
    "ahmad:",
    "important",
    "suspicious",
    "login",
    "attempt",
    "detected",
    "fpx",
    "payment:",
    "rm696.90",
    "processed",
    "successfully.",
    "119.94",
    "ang",
    "kai",
    "liang.",
    "370.54",
    "3500.00mb.",
    "rm1076.24",
    "rm560.51",
    "mynews.",
    "436.00",
    "grab/****5080",
    "-",
    "370.03",
    "20/06/2025",
    "00:01.",
    "3",
    "1283.45",
    "rm1438.10",
    "starbucks.",
    "846.78",
    "rm1258.00",
    "rm471.37",
    "rm1475.21",
    "rm1000.00",
    "meps",
    "trx",
    "5189.",
    "rm217.80",
    "1349.84",
    "celcom.",
    "753.24",
    "****3812/chen",
    "mei",
    "ling",
    "22/06/2025,",
    "23:15.",
    "tech",
    "breakthrough",
    "announced.",
    "kuala",
    "lumpur:",
    "rm1159.71",
    "desk,",
    "413.13",
    "****5986/petronas",
    "18-jun-2025,",
    "10:37:45",
    "rm1160.26",
    "rm1307.17",
    "familymart.",
    "rm1098.40",
    "astro.",
    "11:39",
    "13:21.",
    "1316.92",
    "****9642/siti",
    "2025-06-19,",
    "16:57.",
    "225.00",
    "malaysia.",
    "rm1300.00",
    "amazon",
    "1000.00mb.",
    "84.00",
    "lazada.",
    "1163.00",
    "11:33",
    "rm978.00",
    "manager:",
    "thanks",
    "help",
    "alex",
    "04:38",
    "1453.41",
    "7-eleven.",
    "budget",
    "spent",
    "rm3500.00",
    "rm500",
    "monthly",
    "shopping.",
    "500.00mb.",
    "596.95",
    "15/06/2025,",
    "12:22:45",
    "219.00",
    "credit",
    "limit",
    "warning:",
    "remaining",
    "8200.",
    "rm1460.00",
    "familymart",
    "1365.00",
    "rm250.00",
    "4621.",
    "333.00",
    "930.00",
    "rm500.00",
    "8437.",
    "4259.",
    "18:57.",
    "01:43",
    "06:49",
    "one/****9468",
    "649.00",
    "18-jun-2025",
    "18:40:45.",
    "620.00",
    "652.00",
    "ismail.",
    "668.00",
    "rm447.00",
    "296.00",
    "berhad.",
    "909.95",
    "906.70",
    "chen",
    "rm362.00",
    "bookstore.",
    "rm1457.37",
    "26.76",
    "840.62",
    "11-jun-2025,",
    "07:05:45.",
    "581.71",
    "859.00",
    "1003.05",
    "895.00",
    "sent",
    "rm178.92",
    "via",
    "duitnow.",
    "1387.39",
    "19/06/2025,",
    "00:36:45.",
    "rm758.00",
    "rm954.22",
    "petronas",
    "1487.00",
    "512.00",
    "7-eleven:",
    "rm606.65",
    "365747529563",
    "112.04",
    "2184.",
    "1945.",
    "several",
    "unread",
    "messages",
    "inbox.",
    "7066.",
    "uniqlo:",
    "380.72",
    "305043502568",
    "1150.95",
    "****4258/tenaga",
    "02:44:45",
    "25\u00b0c.",
    "rm324.00",
    "airlines.",
    "rm1000",
    "failed:",
    "rm150.50",
    "could",
    "processed.",
    "2",
    "69.70",
    "rm1081.00",
    "rm1267.53",
    "258.32",
    "douglas",
    "ong",
    "t",
    "100.00",
    "online",
    "shop",
    "341.67",
    "liang",
    "rm488.31",
    "rm1454.00",
    "h&m/****4365",
    "rm1186.47",
    "13/06/2025",
    "05:50:45.",
    "rm389.00",
    "digi.",
    "rm322.96",
    "328.00",
    "rm536.00",
    "t.",
    "897.55",
    "rm1447.59",
    "906.00",
    "eng.",
    "06:07",
    "1077.70",
    "maxis.",
    "rm636.00",
    "rm771.00",
    "rm421.61",
    "rm500.00.",
    "01:03.",
    "klcc",
    "9004.",
    "yin/****7757",
    "rm1447.38",
    "2025-06-02",
    "20:14.",
    "rm1059.44",
    "13:38.",
    "rm386.10",
    "1175.27",
    "1084.00",
    "909.86",
    "823.05",
    "2025-05-29,",
    "10:44:45.",
    "790.08",
    "jaya,",
    "rm250.00.",
    "rm970.69",
    "2582.",
    "rm1412.42",
    "10:58.",
    "rm1292.39",
    "shopee:",
    "1243.00",
    "946413807415",
    "refund",
    "processed:",
    "rahman",
    "rm654.39",
    "petronas.",
    "12,345",
    "684.00",
    "850.63",
    "1434.00",
    "891.00",
    "guardian.",
    "rm852.04",
    "1028.45",
    "ying.",
    "744.49",
    "kfc.",
    "17:56.",
    "rm15.05",
    "overcast",
    "chance",
    "rain,",
    "center:",
    "ismail/****4877",
    "rm1268.94",
    "28-may-2025",
    "01:22:45",
    "497.40",
    "ying/****1055",
    "658.80",
    "2025-05-28",
    "00:45:45.",
    "rm1351.00",
    "rm1234.00",
    "697.05",
    "****5765/seamoney",
    "2025-06-18,",
    "12:53.",
    "rm50.00.",
    "dining.",
    "5203.",
    "rm1384.90",
    "nurhaliza.",
    "shop.",
    "rm1092.78",
    "521.00",
    "337.93",
    "11:35:45.",
    "rm1403.58",
    "rm887.95",
    "136.95",
    "****8713/uniqlo",
    "05:58:45.",
    "shopee.",
    "7",
    "109.33",
    "watsons.",
    "552.04",
    "****9045/grabfood",
    "28-may-2025,",
    "06:21:45",
    "148.31",
    "rm1048.39",
    "rm195.31",
    "maxis:",
    "rm245.07",
    "582204790801",
    "05:32",
    "rm535.11",
    "rm418.64",
    "1469.38",
    "airlines",
    "rm234.23",
    "tealive.",
    "familymart:",
    "rm150.11",
    "611939775626",
    "rm141.65",
    "rm1263.00",
    "shell.",
    "rm432.53",
    "transport.",
    "mrt:",
    "1427.35",
    "190720399331",
    "734.00",
    "rm708.68",
    "john:",
    "can",
    "we",
    "meet",
    "tomorrow?",
    "12:47",
    "931.00",
    "rm435.37",
    "rm1265.14",
    "03:42.",
    "rm648.83",
    "789.00",
    "1457.65",
    "03:27",
    "rm569.64",
    "549.63",
    "369.78",
    "speedmart:",
    "rm730.24",
    "678727813523",
    "107.00",
    "rm1310.97",
    "mrt.",
    "giant:",
    "363.15",
    "913823251652",
    "218.63",
    "1495.63",
    "rm126.00",
    "rm1299.52",
    "613273608033",
    "rm857.38",
    "1495.27",
    "1161.",
    "158.28",
    "rm1366.72",
    "1294.00",
    "****3831/siti",
    "2025-06-02,",
    "00:31:45.",
    "987.67",
    "420.00",
    "1019.00",
    "4365.",
    "rm1499.98",
    "rm432.71",
    "935.76",
    "5496.",
    "217.84",
    "349.00",
    "rm899.00",
    "lumpur,",
    "973.87",
    "190.00",
    "sarah:",
    "1258.85",
    "rm584.57",
    "1228.52",
    "103.33",
    "1315.02",
    "ling.",
    "969.54",
    "rm106.00",
    "817.10",
    "****6971/tan",
    "20:05:45.",
    "180.90",
    "1425.00",
    "grabfood.",
    "ling:",
    "rm1064.87",
    "768305513340",
    "rm1088.72",
    "145.00",
    "03/06/2025,",
    "05:24:45",
    "rm1294.18",
    "1190.53",
    "rm332.00",
    "yin.",
    "1130.89",
    "****4620/telekom",
    "2025-06-08,",
    "04:26.",
    "ling/****6568",
    "rm1235.38",
    "16-jun-2025",
    "09:47.",
    "rm461.31",
    "237277485201",
    "858.53",
    "3140.",
    "138.00",
    "rm1441.43",
    "rm344.00",
    "119.69",
    "rm347.20",
    "1050.32",
    "wei.",
    "grocer/****5620",
    "1268.00",
    "08-jun-2025",
    "10:23.",
    "1410.10",
    "261.08",
    "****4069/astro",
    "08:06:45",
    "16:12.",
    "rm783.00",
    "1247.00",
    "rm663.75",
    "22.00",
    "1294.15",
    "speedmart.",
    "64.00",
    "14-jun-2025,",
    "03:16:45.",
    "rm1450.00",
    "rm1107.50",
    "rm1213.00",
    "malaysia/****3453",
    "301.00",
    "09-jun-2025",
    "02:55:45",
    "rm641.09",
    "1208.02",
    "25-jun-2025,",
    "04:05:45.",
    "542.24",
    "2228.",
    "1199.05",
    "160.83",
    "09-jun-2025,",
    "01:41:45",
    "rm724.16",
    "1029.99",
    "1197.00",
    "697.00",
    "10:40",
    "1432.80",
    "rm868.93",
    "rm1429.11",
    "rm78.49",
    "rm1079.00",
    "rm966.79",
    "542.00",
    "wei/****4843",
    "355.49",
    "12:59:45.",
    "rm411.55",
    "270.00",
    "15-jun-2025,",
    "04:24.",
    "35.64",
    "rm767.00",
    "1360.67",
    "2231.",
    "rm1287.00",
    "619.48",
    "shell/****5338",
    "115.39",
    "11/06/2025",
    "07:35.",
    "rm1156.94",
    "1091.76",
    "amazon.",
    "rm312.00",
    "02:33.",
    "244.00",
    "50.00mb.",
    "rm436.13",
    "rm1489.00",
    "rm398.00",
    "rm881.71",
    "188.00",
    "1458.65",
    "04-jun-2025,",
    "09:29:45.",
    "rm187.28",
    "668.03",
    "one.",
    "11:43.",
    "rm1270.00",
    "1149.00",
    "****7958/lee",
    "13-jun-2025,",
    "02:05:45",
    "1002.00",
    "06-jun-2025,",
    "06:22:45",
    "5553.",
    "54.00",
    "****4179/google",
    "2025-05-30,",
    "09:40.",
    "1610.",
    "571.00",
    "1232.00",
    "jaya.",
    "digi:",
    "rm991.00",
    "754084125765",
    "rm761.32",
    "01:57.",
    "rm637.40",
    "yin:",
    "831567513066",
    "rm256.00",
    "864.31",
    "****8639/busonlineticket",
    "00:50.",
    "rm462.00",
    "03:47",
    "rm1412.00",
    "661.96",
    "rm436.21",
    "282.00",
    "rm861.44",
    "rm832.00",
    "981.00",
    "****7884/grab",
    "26/06/2025,",
    "21:34:45.",
    "rm1012.88",
    "alam,",
    "rm1293.63",
    "bookstore:",
    "rm1272.70",
    "922865683567",
    "watsons/****5681",
    "rm142.18",
    "2025-06-23",
    "21:15:45.",
    "rm69.50",
    "mcdonald's.",
    "9981.",
    "rm553.01",
    "618.48",
    "479.95",
    "rm146.43",
    "6007.",
    "2858.",
    "rm315.53",
    "21:39.",
    "3350.",
    "09:25",
    "849.00",
    "****4686/goh",
    "25/06/2025,",
    "02:15.",
    "rm672.42",
    "rm775.68",
    "rm454.80",
    "rm588.00",
    "rm1202.50",
    "15:14.",
    "rm1442.00",
    "667882119195",
    "722.26",
    "04:20",
    "rm16.56",
    "1089.00",
    "1377.00",
    "593.27",
    "435.08",
    "rm1318.50",
    "rm1032.52",
    "4344.",
    "rm540.00",
    "08:44",
    "services:",
    "rm1456.54",
    "246013024629",
    "rm1434.42",
    "rm14.37",
    "rm139.09",
    "rm1449.89",
    "rm899.29",
    "02:03",
    "bookstore/****6633",
    "rm398.25",
    "13-jun-2025",
    "04:22:45",
    "639.13",
    "****7228/kfc",
    "01:47:45",
    "819.28",
    "mcdonald's/****1614",
    "1261.00",
    "14/06/2025",
    "07:19:45",
    "1078.23",
    "rm1243.00",
    "902.31",
    "01:06.",
    "801.69",
    "02:14.",
    "936.88",
    "267.16",
    "393.26",
    "730.04",
    "1187.00",
    "rm1461.00",
    "16:21.",
    "512.80",
    "shopee/****5407",
    "390.00",
    "26-jun-2025",
    "04:45:45.",
    "20:02.",
    "596.38",
    "6139.",
    "833.00",
    "455.03",
    "****2801/white",
    "24/06/2025,",
    "21:55:45.",
    "rm1233.85",
    "rm1402.36",
    "06:57",
    "8945.",
    "1480.09",
    "rm769.66",
    "rm868.09",
    "rm3500.00.",
    "rm1142.45",
    "digi/****2677",
    "52.00",
    "2025-06-05",
    "03:05:45.",
    "1204.65",
    "1242.00",
    "657.00",
    "139.28",
    "3.23",
    "1126.77",
    "rm60.88",
    "rm87.78",
    "grab/****1532",
    "rm355.83",
    "2025-06-09",
    "14:53:45.",
    "rm925.79",
    "08:55.",
    "rm392.00",
    "872.66",
    "giant.",
    "01:53.",
    "12:06",
    "778.92",
    "76.00",
    "rm912.62",
    "11/06/2025,",
    "10:55:45",
    "742.40",
    "****8589/popular",
    "2025-06-23,",
    "10:14:45.",
    "01:30",
    "lazada:",
    "rm1002.72",
    "960750978044",
    "1395.59",
    "1409.72",
    "6845.",
    "1113.79",
    "rm1003.00",
    "18.91",
    "rm116.94",
    "1323.95",
    "rm1432.73",
    "mcdonald's/****3534",
    "rm777.05",
    "10:35:45",
    "rm200",
    "rm191.80",
